tutorials/fluidSolidInteraction/wavesOnDam/Allrun
#!/bin/bash

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Create solid mesh and zones
runApplication -l log.blockMesh.solid blockMesh -region solid
runApplication -l log.setSet.solid setSet -region solid -batch setBatch.solid
runApplication -l log.setsToZones.solid setsToZones -region solid -noFlipMap

# Create fluid mesh and zones
runApplication -l log.blockMesh.fluid blockMesh -region fluid
runApplication -l log.setSet.fluid setSet -region fluid -batch setBatch.fluid
runApplication -l log.setsToZones.fluid setsToZones -region fluid -noFlipMap

# Set fluid wave parameters
# As the waves2Foam utilities do not have the "-region" option, we will
# temporarily move the fluid mesh and settings to the main constant directory
# and run the waves2Foam utility and then move the fluid mesh and setting back 

# Move fluid to default directory
\mv constant/fluid/waveProperties.input constant/
\mv constant/fluid/waveProperties constant/
\mv constant/fluid/transportProperties constant/
\mv constant/fluid/g constant/
\mv constant/fluid/polyMesh constant/
\mv 0/fluid/alpha1 0/
\mv 0/fluid/U 0/
\mv 0/fluid/pd 0/

# Compute the wave parameters
runApplication  -l log.setWaveParameters.fluid  setWaveParameters

# Set the wave field
runApplication -l log.setWaveField.fluid setWaveField

# Move fluid back to fluid sub-directory
\mv constant/waveProperties.input constant/fluid/
\mv constant/waveProperties constant/fluid/
\mv constant/transportProperties constant/fluid/
\mv constant/g constant/fluid/
\mv constant/polyMesh constant/fluid/
\mv 0/alpha1 0/fluid/
\mv 0/U 0/fluid/
\mv 0/pd 0/fluid/

# Run solver in serial
runApplication solids4Foam

# Run parallel
#runApplication -l log.decomposePar.fluid decomposePar -region fluid
#runApplication -l log.decomposePar.solid decomposePar -region solid
#runParallel solids4Foam 4
#runApplication -l log.reconstructPar.fluid reconstructPar -region fluid
#runApplication -l log.reconstructPar.solid reconstructPar -region solid

# ----------------------------------------------------------------- end-of-file

