tutorials/fluidSolidInteraction/wavesOnDam/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.146;

vertices
(
    (2 0 0)
    (2.16438 0 0)
    (2.16438 0.32876 0)
    (2 0.32876 0)

    (2 0 0.1)
    (2.16438 0 0.1)
    (2.16438 0.32876 0.1)
    (2 0.32876 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (5 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    base
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    interface
    {
        type wall;
        faces
        (
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
